# Dotfiles Brewfile
# Install all dependencies with: brew bundle

# Taps
tap "homebrew/bundle"

# CLI Tools
brew "git-delta"        # Syntax-highlighted git diffs
brew "zoxide"           # Smart directory jumper
brew "lazygit"          # Terminal UI for git
brew "jq"               # JSON processor
brew "yq"               # YAML processor
brew "fzf"              # Fuzzy finder
brew "ripgrep"          # Fast grep alternative
brew "fd"               # Fast find alternative
brew "bat"              # Cat with syntax highlighting
brew "eza"              # Modern ls replacement
brew "antidote"         # Zsh plugin manager
brew "starship"         # Cross-shell prompt
brew "tmux"             # Terminal multiplexer
brew "neovim"           # Modern vim

# Optional but recommended
brew "gh"               # GitHub CLI
brew "node"             # Node.js for LSP servers
